IDENTIFICATION DIVISION.
       PROGRAM-ID. reverse-string.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STRING  PIC X(64).
       01 WS-LENGTH  PIC 99.
       01 WS-REVERSE PIC X(64).
       01 WS-COUNTER PIC 99.


       PROCEDURE DIVISION.
       REVERSE-STRING.
         MOVE FUNCTION LENGTH(WS-STRING) TO WS-LENGTH
         PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL
          WS-COUNTER > WS-LENGTH
            MOVE WS-STRING(WS-COUNTER:1) TO
               WS-REVERSE(WS-LENGTH - WS-COUNTER + 1:1)
         END-PERFORM
         MOVE FUNCTION TRIM(WS-REVERSE) TO WS-REVERSE
         MOVE WS-REVERSE TO WS-STRING
         
STRING* Reverse a string and display result
       
       DISPLAY WS-STRING.