IDENTIFICATION DIVISION.
       PROGRAM-ID. armstrong-numbers.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY. FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMBER          PIC X(8).
       01 WS-ORIGINAL        PIC 9(8).
       01 WS-LENGTH          PIC 9.
       01 WS-DIGIT-TO-CHECK  PIC 9.
       01 WS-DIGIT-RAISED    PIC 9(8).
       01 WS-SUM             PIC 9(8).
       01 WS-COUNTER         PIC 9.
       01 WS-RESULT          PIC 9.


       PROCEDURE DIVISION.
       ARMSTRONG-NUMBERS.
      * ARMSTRONG NUMBERS ARE NUMBERS THAT ARE THE SUM OF THEIR
      * DIGITS RAISED TO THE POWER OF THE NUMBER OF DIGITS IN THE NUMBER
      * EXAMPLE: 9 = 9^1 = 9 AND 153 = 1^3 + 5^3 + 3^3 = 1 + 125 + 27
      *
      * BASIC PROCESS:
      *    1) COUNT HOW MANY DIGITS
      *    2) BREAK THE NUMBER INTO INDIVIDUAL DIGITS
      *    3) RAISE EACH TO THE POWER OF HOW MANY DIGITS
      *    4) ADD THEM TOGETHER AND COMPARE TO ORIGINAL NUMBER
      *    5) IF SAME, IT IS ARMSTRONG. WS-RESULT = 1
      *    6) IF DIFFERENT, IT'S NOT. WS-RESULT = 0
       DISPLAY "ORIGINAL NUMBER: " WS-NUMBER
       MOVE FUNCTION TRIM(WS-NUMBER) TO WS-ORIGINAL
       DISPLAY "ORIGINAL NUMBER (CONVERTED): " WS-ORIGINAL
       COMPUTE WS-LENGTH = FUNCTION LENGTH(FUNCTION TRIM(WS-NUMBER))
       DISPLAY "LENGTH: " WS-LENGTH
       MOVE 1 TO WS-COUNTER
       MOVE 0 TO WS-SUM
       PERFORM WS-LENGTH TIMES
         DISPLAY FUNCTION TRIM(WS-NUMBER(WS-COUNTER:1))              
         MOVE FUNCTION TRIM(WS-NUMBER(WS-COUNTER:1)) TO
           WS-DIGIT-TO-CHECK
         COMPUTE WS-DIGIT-RAISED = WS-DIGIT-TO-CHECK ** WS-LENGTH
         COMPUTE WS-SUM = WS-SUM + WS-DIGIT-RAISED
         DISPLAY WS-DIGIT-TO-CHECK "^" WS-LENGTH " = "
           WS-DIGIT-RAISED
         DISPLAY "RUNNING SUM: " WS-SUM
         ADD 1 TO WS-COUNTER GIVING WS-COUNTER
       END-PERFORM
       DISPLAY "FINAL SUM: " WS-SUM
       IF WS-SUM = WS-ORIGINAL THEN
        DISPLAY WS-ORIGINAL " IS AN ARMSTRONG NUMBER!"
        MOVE 1 TO WS-RESULT
       ELSE
        DISPLAY WS-ORIGINAL " IS NOT AN ARMSTRONG NUMBER"
        MOVE 0 TO WS-RESULT
       END-IF.