IDENTIFICATION DIVISION.
       PROGRAM-ID. nucleotide-count.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY. FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DNA     PIC X(128).
       01 WS-A       PIC 9(4).
       01 WS-C       PIC 9(4).
       01 WS-G       PIC 9(4).
       01 WS-T       PIC 9(4).
       01 WS-ERROR   PIC X(36).
       01 WS-COUNTER PIC 999.
      
       PROCEDURE DIVISION.
       NUCLEOTIDE-COUNT.
      * CHECK FOR EXTRANEOUS CHARACTERS (NOT A, C, G, T)
      * COUNT EACH CHARACTER
       MOVE SPACES TO WS-ERROR
       PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER IS > 128
         IF WS-DNA(WS-COUNTER:1) NOT = "A" AND
            WS-DNA(WS-COUNTER:1) NOT = "C" AND
            WS-DNA(WS-COUNTER:1) NOT = "G" AND
            WS-DNA(WS-COUNTER:1) NOT = "T" AND
            WS-DNA(WS-COUNTER:1) NOT = " " THEN
            MOVE "ERROR: Invalid nucleotide in strand" TO WS-ERROR
         END-IF
       END-PERFORM
       INSPECT WS-DNA TALLYING WS-A FOR ALL "A"
       INSPECT WS-DNA TALLYING WS-C FOR ALL "C"
       INSPECT WS-DNA TALLYING WS-G FOR ALL "G"
       INSPECT WS-DNA TALLYING WS-T FOR ALL "T"   
       .